{"frase_idx": 8, "recorte_id": "DISCURSO_001_FR_009", "codigo": "DISCURSO_001", "error": "La respuesta del modelo no es una lista válida de actores.", "respuesta_cruda": " [\n{\n\"actor\": \"expositores\",\n\"tipo\": \"colectivo\",\n\"modo\": \"explícito\"\n},\n{\n\"actor\": \"audiencia\",\n\"tipo\": \"colectivo\",\n\"modo\": \"inferido\",\n\"explicacion\": \"1\"\n}\n]", "prompt_usado": "Tarea:\nIdentificá todos los actores representados en la frase objetivo, ya sean explícitos o inferidos, excepto el enunciador y los enunciatarios. Jamás agregues actores que no estén referidos léxica o sintácticamente en la frase objetivo\nDatos disponibles:\n- Resumen global del discurso: En este discurso político, Javier Milei aborda temas como el liberalismo y el colectivismo, criticando la promoción de diversidad, equidad e inclusión en empresas y sociedad en general. Según el orador, esto ha sustituido la igualdad ante la ley por discriminación positiva a grupos sociales, lo que fragmenta la sociedad y debilita las instituciones. El discurso se enfoca en llamar a la libertad, afirmando que Argentina necesita una nueva dirección política para sacarla de su último siglo de humillación y llevar sus ideas de libertad al gran público. Menciona la necesidad de una batalla cultural por las ideas de libertad y progreso, enfatizando la importancia de ser soldados en esta lucha. Además, hace un llamado a Argentina para ser el país más grande de América Latina y exhorta a los oyentes a sentirse orgullosos de ser argentinos nuevamente. El discurso enfatiza la necesidad de un cambio en la política argentina y una batalla cultural para libertad y progreso, al tiempo que se critica a quienes han mantenido al país en situaciones difíciles durante décadas.\n- Fecha del discurso: Martes 22 de julio de 2025\n- Lugar del discurso (con justificación): El discurso fue pronunciado en la ciudad de Córdoba, provincia de Córdoba, Argentina. Esto se infiere a partir del título del discurso y los fragmentos clave que mencionan La Derecha Fest.\n- Tipo de discurso: discurso político\n- Enunciador: Javier Milei\n- Enunciatarios: La derecha (tipo: prodestinatario)\nLa oposición política explícita (tipo: contradestinatario)\nLa población argentina en general (tipo: paradestinatario)\n- Frase objetivo a analizar: \"también quiero agradecer a todos los expositores que me precedieron y, por supuesto, a todos ustedes.\"\n- Frases de contexto (anteriores y posteriores): ¿saquen al pingüino del cajón?\n¡viva la libertad, carajo!\nprimero que nada, quiero extenderle un cálido saludo a mi queridísimo amigo agustín laje como así también a todo el equipo de la derecha diario por organizar este enorme evento.\nmuchas gracias.\ntambién quiero agradecer a todos los expositores que me precedieron y, por supuesto, a todos ustedes.\ny también quiero agradecer a todos aquellos que no pudieron venir, pero nos están siguiendo desde sus casas.\nson ustedes que dan todo por sacar adelante un país al que años de estatismo descontrolado parecían haber condenado al país a la miseria.\n- Reglas de inferencia para identificar actores: Reglas heurísticas para la inferencia de actores representados (aunque no mencionados explícitamente):\nEstas reglas pueden usarse únicamente cuando la frase objetivo contiene expresiones que habilitan una inferencia (nominalizaciones, sujetos tácitos, pronombres, etc.). No apliques las reglas si no hay ningún indicio en la frase objetivo que habilite la deducción del actor.\n1. **Nominalizaciones**\n- Si la frase contiene sustantivos derivados de verbos (por ejemplo, \"represión\", \"despido\", \"protesta\", \"expulsión\"), inferí quién realiza o experimenta la acción nominalizada.\n- Buscá posibles sujetos agentes o pacientes implícitos.\n- Ejemplo:\n- Frase: \"La represión fue brutal.\"\n- Actor inferido: \"fuerzas de seguridad\" (como agente de la represión), aunque no estén nombradas.\n2. **Sujeto tácito / elíptico**\n- Cuando el verbo está conjugado pero el sujeto está omitido (por ejemplo, en oraciones con sujeto implícito), deducí quién realiza la acción a partir del contexto (otras frases cercanas, marco temático, roles institucionales).\n- Ejemplo:\n- Frase: \"Ordenaron el desalojo.\"\n- Actor inferido: \"autoridades estatales\" o \"fuerzas de seguridad\", según el discurso.\n3. **Pronombres y correferencias**\n- Si hay pronombres personales (\"ellos\", \"ella\", \"nosotros\", etc.) o demostrativos (\"esa gente\", \"aquellos\"), buscá en las frases anteriores o posteriores a quién se refieren.\n- También interpretá expresiones anafóricas o catafóricas.\n- Ejemplo:\n- Frase: \"Ellos fueron los responsables.\"\n- Actor inferido: el grupo mencionado en frases anteriores.\n4. **Metonimias y sinécdoques**\n- Si se menciona una parte por el todo (\"la Casa Rosada\", \"la gorra\", \"los del poder judicial\"), inferí el actor que representa (instituciones, funcionarios, colectivos).\n- Ejemplo:\n- Frase: \"La Casa Rosada decidió avanzar.\"\n- Actor inferido: \"Presidencia de la Nación\" o \"Gobierno nacional\".\n5. **Construcciones impersonales y pasivas**\n- Cuando hay formas pasivas o impersonales (\"se decidió\", \"fue ejecutado\", \"hubo represión\"), identificá actores plausibles desde el contexto temático o la lógica de los procesos discursivos.\n- Ejemplo:\n- Frase: \"Se establecieron nuevas reglas.\"\n- Actor inferido: \"Ministerio\" o \"autoridades educativas\", si el contexto es educativo.\n6. **Marcos institucionales o temáticos**\n- Usá el conocimiento inferible del tipo de discurso, marco institucional y actores sociales típicos del campo para completar actores implícitos.\n- Por ejemplo, si el discurso trata sobre salud pública, actores típicos pueden ser \"Ministerio de Salud\", \"profesionales médicos\", \"pacientes\", etc.\n7. **Recursos evaluativos o afectivos**\n- Las valoraciones afectivas (\"nos abandonaron\", \"fuimos víctimas\", \"nos negaron ayuda\") suelen implicar actores agentes tácitos.\n- Buscá quién actúa sobre quién, incluso si solo se marca desde el punto de vista del afectado.\nInstrucciones generales:\n- No inventes actores; deducí solo si hay elementos semánticos, sintácticos o contextuales suficientes.\n- Evitá repetir actores ya descartados globalmente como enunciador o enunciatario.\n- Jamás incluyas actores que no puedan reponerse de la frase objetivo a analizar.\n- Ontología de actores (usar solo estas categorías): {\n\"ontologia_actores\": [\n{\n\"tipo\": \"humano_individual\",\n\"descripcion\": \"Personas individuales con identidad propia (por ejemplo, Carlos Pellegrini, un asistente, un líder)\"\n},\n{\n\"tipo\": \"colectivo\",\n\"descripcion\": \"Grupos de personas que actúan o sienten como unidad (por ejemplo, \\\"gente\\\", \\\"ciudadanos\\\", \\\"seguidores\\\", \\\"enemigos\\\", \\\"críticos\\\", \\\"partidarios\\\")\"\n},\n{\n\"tipo\": \"institucional\",\n\"descripcion\": \"Organizaciones o entidades que actúan institucionalmente (por ejemplo, \\\"Congreso\\\", \\\"Gobierno\\\", \\\"La Libertad Avanza\\\", \\\"Presidencia de la Nación\\\")\"\n}\n],\n\"reglas_adicionales\": [\n\"Incluir únicamente actores que puedan ser experienciadores de emociones o acciones sociales (por ejemplo, no incluir \\\"la economía\\\", \\\"la situación\\\", \\\"el pasado\\\")\",\n\"Excluir siempre al enunciador y a los enunciatarios, incluso si son referidos indirectamente\"\n]\n}\nCriterios de identificación:\n- Solo incluí actores cuya presencia pueda fundamentarse claramente en la frase objetivo, ya sea explícita o por inferencia sustentada en vínculos léxicos o sintácticos claros.\n- Podés usar las frases de contexto para interpretar la frase objetivo, pero nunca jamás para agregar actores que no estén referidos léxica o sintácticamente en la frase objetivo.\n- No incluyas al enunciador ni a los enunciatarios.\n- No agregues actores que no pertenezcan a las categorías listadas en la ontología.\nInvalidaciones:\n- No incluyas actores mencionados solamente en el contexto sin vínculo explícito con la frase objetivo.\n- Excluir cualquier mención ambigua, no anclable o sin justificación clara.\nFormato de salida:\n- Usá únicamente las categorías de la ontología.\n- Asegurate de que cada objeto JSON incluya todas las claves separadas por comas.\n- Especial atención: debe haber coma entre \"modo\": ... y \"justificacion\": ...\n- Especial atención: no uses comillas dentro de los valores de texto (para evitar errores de sintaxis).\nRespuesta esperada: una lista JSON exclusivamente, sin texto adicional ni comillas internas:\n\"\"\"[\n{\n\"actor\": \"Nombre del actor (sustantivo o sintagma nominal)\",\n\"tipo\": \"Categoría según la ontología\",\n\"modo\": \"explícito\" o \"inferido\",\n\"explicación\": \"No justifiques. Sólo agregá el número de regla de inferencia utilizada, según las heurísticas\"\n}\n]\"\"\"\n⚠️ Devolvé solo una lista JSON válida. Nada más."}
